# 1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column).

In [10]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
df['FlightNumber']=df['FlightNumber']+10
df['FlightNumber'].fillna(value=10,inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10055.0      [23, 47]               KLM(!)
1      MAdrid_miLAN          10.0            []                 (12)
2  londON_StockhOlm       10075.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          10.0          [13]       12. Air France
4   Brussels_londOn       10095.0      [67, 32]          "Swiss Air"

# 2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame.

In [12]:
df_temp=df['From_To'].str.split("_",expand=True)
df_temp.columns=['From','To']
df_temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# 3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [13]:
df_temp['From']=df_temp['From'].str.capitalize()
df_temp['To']=df_temp['To'].str.capitalize()
df_temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# 4. Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [14]:
df.drop(['From_To'],axis=1,inplace=True)
df=pd.concat([df,df_temp],axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10055.0      [23, 47]               KLM(!)    London      Paris
1          10.0            []                 (12)    Madrid      Milan
2       10075.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3          10.0          [13]       12. Air France  Budapest      Paris
4       10095.0      [67, 32]          "Swiss Air"  Brussels     London

# 5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [15]:
Delay_1=[]
Delay_2=[]
Delay_3=[]
for val in df['RecentDelays']:
    try:
        delay_1 =val[0]
    except:
        delay_1 =np.NaN
    try:
        delay_2 =val[1]
    except:
        delay_2 =np.NaN
    try:
        delay_3 =val[2]
    except:
        delay_3 =np.NaN
        
    Delay_1.append(delay_1)
    Delay_2.append(delay_2)
    Delay_3.append(delay_3)
    Delay_1

In [16]:
Delay_2

[47, nan, 43, nan, 32]

In [17]:
Delay_3

[nan, nan, 87, nan, nan]

In [18]:
Delays=pd.DataFrame({'Delay_1':Delay_1, 'Delay_2':Delay_2,'Delay_3':Delay_3})

In [19]:
Delays

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [20]:
df=pd.concat([df.drop('RecentDelays',axis=1),Delays],axis=1)
df

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10055.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10.0,(12),Madrid,Milan,NaN,NaN,NaN
2,10075.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10095.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN